### 📖 Terraform Plan (infra/modules/azure_core_infra/example/develop) - success
<details>
<summary>Show Plan</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_cosmosdb_sql_database.db will be created
  + resource "azurerm_cosmosdb_sql_database" "db" {
      + account_name        = "dx-d-itn-modules-test-cosno-01"
      + id                  = (known after apply)
      + name                = "db"
      + resource_group_name = "dx-d-itn-test-rg-01"
      + throughput          = (known after apply)
    }

  # azurerm_subnet.apim will be created
  + resource "azurerm_subnet" "apim" {
      + address_prefixes                              = [
          + "10.60.2.0/24",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "dx-d-itn-modules-test-apim-snet-01"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "dx-d-itn-network-rg-01"
      + virtual_network_name                          = "dx-d-itn-common-vnet-01"
    }

  # module.apim.azurerm_api_management.this will be created
  + resource "azurerm_api_management" "this" {
      + client_certificate_enabled    = false
      + developer_portal_url          = (known after apply)
      + gateway_disabled              = false
      + gateway_regional_url          = (known after apply)
      + gateway_url                   = (known after apply)
      + id                            = (known after apply)
      + location                      = "italynorth"
      + management_api_url            = (known after apply)
      + min_api_version               = "2021-08-01"
      + name                          = "dx-d-itn-modules-test-apim-01"
      + notification_sender_email     = (known after apply)
      + portal_url                    = (known after apply)
      + private_ip_addresses          = (known after apply)
      + public_ip_addresses           = (known after apply)
      + public_network_access_enabled = true
      + publisher_email               = "common-dx@pagopa.it"
      + publisher_name                = "Common DX"
      + resource_group_name           = "dx-d-itn-test-rg-01"
      + scm_url                       = (known after apply)
      + sku_name                      = "Developer_1"
      + tags                          = {
          + "BusinessUnit"   = "DevEx"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Dev"
          + "ManagementTeam" = "Developer Experience"
          + "ModuleName"     = "azure_api_management"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "1.2.2"
          + "Source"         = "https://github.com/pagopa/dx/modules/azure_core_infra/examples/develop"
        }
      + virtual_network_type          = "Internal"

      + delegation (known after apply)

      + hostname_configuration (known after apply)

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + protocols (known after apply)

      + security (known after apply)

      + sign_in (known after apply)

      + sign_up {
          + enabled = false

          + terms_of_service {
              + consent_required = false
              + enabled          = false
            }
        }

      + tenant_access (known after apply)

      + virtual_network_configuration {
          + subnet_id = (known after apply)
        }
    }

  # module.apim.azurerm_network_security_group.nsg_apim will be created
  + resource "azurerm_network_security_group" "nsg_apim" {
      + id                  = (known after apply)
      + location            = "italynorth"
      + name                = "dx-d-itn-modules-test-apim-nsg-01"
      + resource_group_name = "dx-d-itn-network-rg-01"
      + security_rule       = [
          + {
              + access                                     = "Allow"
              + description                                = "Access to Azure Key Vault for core service functionality"
              + destination_address_prefix                 = "AzureKeyVault"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "443"
              + destination_port_ranges                    = []
              + direction                                  = "Outbound"
              + name                                       = "azure-keyvault"
              + priority                                   = 202
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "VirtualNetwork"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
          + {
              + access                                     = "Allow"
              + description                                = "Access to Azure SQL endpoints for core service functionality"
              + destination_address_prefix                 = "SQL"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "1433"
              + destination_port_ranges                    = []
              + direction                                  = "Outbound"
              + name                                       = "sql"
              + priority                                   = 201
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "VirtualNetwork"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
          + {
              + access                                     = "Allow"
              + description                                = "Azure Infrastructure Load Balancer"
              + destination_address_prefix                 = "VirtualNetwork"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "6390"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "azure-load-balancer"
              + priority                                   = 201
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "AzureLoadBalancer"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
          + {
              + access                                     = "Allow"
              + description                                = "Dependency on Azure Storage for core service functionality"
              + destination_address_prefix                 = "Storage"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "443"
              + destination_port_ranges                    = []
              + direction                                  = "Outbound"
              + name                                       = "storage"
              + priority                                   = 200
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "VirtualNetwork"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
          + {
              + access                                     = "Allow"
              + description                                = "Management endpoint for Azure portal and PowerShell"
              + destination_address_prefix                 = "VirtualNetwork"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_range                     = "3443"
              + destination_port_ranges                    = []
              + direction                                  = "Inbound"
              + name                                       = "apim-management"
              + priority                                   = 200
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "ApiManagement"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
            },
          + {
              + access                                     = "Allow"
              + description                                = "Publish Diagnostics Logs and Metrics, Resource Health, and Application Insights"
              + destination_address_prefix                 = "AzureMonitor"
              + destination_address_prefixes               = []
              + destination_application_security_group_ids = []
              + destination_port_ranges                    = [
                  + "1886",
                  + "443",
                ]
              + direction                                  = "Outbound"
              + name                                       = "azure-monitor"
              + priority                                   = 203
              + protocol                                   = "Tcp"
              + source_address_prefix                      = "VirtualNetwork"
              + source_address_prefixes                    = []
              + source_application_security_group_ids      = []
              + source_port_range                          = "*"
              + source_port_ranges                         = []
                # (1 unchanged attribute hidden)
            },
        ]
      + tags                = {
          + "BusinessUnit"   = "DevEx"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Dev"
          + "ManagementTeam" = "Developer Experience"
          + "ModuleName"     = "azure_api_management"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "1.2.2"
          + "Source"         = "https://github.com/pagopa/dx/modules/azure_core_infra/examples/develop"
        }
    }

  # module.apim.azurerm_private_dns_a_record.apim_azure_api_net will be created
  + resource "azurerm_private_dns_a_record" "apim_azure_api_net" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "dx-d-itn-modules-test-apim-01"
      + records             = (known after apply)
      + resource_group_name = "dx-d-itn-network-rg-01"
      + tags                = {
          + "BusinessUnit"   = "DevEx"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Dev"
          + "ManagementTeam" = "Developer Experience"
          + "ModuleName"     = "azure_api_management"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "1.2.2"
          + "Source"         = "https://github.com/pagopa/dx/modules/azure_core_infra/examples/develop"
        }
      + ttl                 = 3600
      + zone_name           = "azure-api.net"
    }

  # module.apim.azurerm_private_dns_a_record.apim_management_azure_api_net will be created
  + resource "azurerm_private_dns_a_record" "apim_management_azure_api_net" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "dx-d-itn-modules-test-apim-01"
      + records             = (known after apply)
      + resource_group_name = "dx-d-itn-network-rg-01"
      + tags                = {
          + "BusinessUnit"   = "DevEx"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Dev"
          + "ManagementTeam" = "Developer Experience"
          + "ModuleName"     = "azure_api_management"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "1.2.2"
          + "Source"         = "https://github.com/pagopa/dx/modules/azure_core_infra/examples/develop"
        }
      + ttl                 = 3600
      + zone_name           = "management.azure-api.net"
    }

  # module.apim.azurerm_private_dns_a_record.apim_scm_azure_api_net will be created
  + resource "azurerm_private_dns_a_record" "apim_scm_azure_api_net" {
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + name                = "dx-d-itn-modules-test-apim-01"
      + records             = (known after apply)
      + resource_group_name = "dx-d-itn-network-rg-01"
      + tags                = {
          + "BusinessUnit"   = "DevEx"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Dev"
          + "ManagementTeam" = "Developer Experience"
          + "ModuleName"     = "azure_api_management"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "1.2.2"
          + "Source"         = "https://github.com/pagopa/dx/modules/azure_core_infra/examples/develop"
        }
      + ttl                 = 3600
      + zone_name           = "scm.azure-api.net"
    }

  # module.apim.azurerm_subnet_network_security_group_association.snet_nsg will be created
  + resource "azurerm_subnet_network_security_group_association" "snet_nsg" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # module.core.azurerm_resource_group.common will be created
  + resource "azurerm_resource_group" "common" {
      + id       = (known after apply)
      + location = "italynorth"
      + name     = "dx-d-itn-common-rg-01"
      + tags     = {
          + "BusinessUnit"   = "DevEx"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Dev"
          + "ManagementTeam" = "Developer Experience"
          + "ModuleName"     = "azure_core_infra"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "1.0.9"
          + "Source"         = "https://github.com/pagopa/dx/modules/azure_core_infra/examples/develop"
        }
    }

  # module.core.azurerm_resource_group.gh_runner will be created
  + resource "azurerm_resource_group" "gh_runner" {
      + id       = (known after apply)
      + location = "italynorth"
      + name     = "dx-d-itn-github-runner-rg-01"
      + tags     = {
          + "BusinessUnit"   = "DevEx"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Dev"
          + "ManagementTeam" = "Developer Experience"
          + "ModuleName"     = "azure_core_infra"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "1.0.9"
          + "Source"         = "https://github.com/pagopa/dx/modules/azure_core_infra/examples/develop"
        }
    }

  # module.core.azurerm_resource_group.network will be created
  + resource "azurerm_resource_group" "network" {
      + id       = (known after apply)
      + location = "italynorth"
      + name     = "dx-d-itn-network-rg-01"
      + tags     = {
          + "BusinessUnit"   = "DevEx"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Dev"
          + "ManagementTeam" = "Developer Experience"
          + "ModuleName"     = "azure_core_infra"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "1.0.9"
          + "Source"         = "https://github.com/pagopa/dx/modules/azure_core_infra/examples/develop"
        }
    }

  # module.core.azurerm_resource_group.test[0] will be created
  + resource "azurerm_resource_group" "test" {
      + id       = (known after apply)
      + location = "italynorth"
      + name     = "dx-d-itn-test-rg-01"
      + tags     = {
          + "BusinessUnit"   = "DevEx"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Dev"
          + "ManagementTeam" = "Developer Experience"
          + "ModuleName"     = "azure_core_infra"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "1.0.9"
          + "Source"         = "https://github.com/pagopa/dx/modules/azure_core_infra/examples/develop"
        }
    }

  # module.cosmos.azurerm_cosmosdb_account.this will be created
  + resource "azurerm_cosmosdb_account" "this" {
      + access_key_metadata_writes_enabled           = true
      + analytical_storage_enabled                   = false
      + automatic_failover_enabled                   = true
      + burst_capacity_enabled                       = false
      + create_mode                                  = (known after apply)
      + default_identity_type                        = "FirstPartyIdentity"
      + endpoint                                     = (known after apply)
      + free_tier_enabled                            = false
      + id                                           = (known after apply)
      + is_virtual_network_filter_enabled            = false
      + kind                                         = "GlobalDocumentDB"
      + local_authentication_disabled                = false
      + location                                     = "italynorth"
      + minimal_tls_version                          = "Tls12"
      + mongo_server_version                         = (known after apply)
      + multiple_write_locations_enabled             = false
      + name                                         = "dx-d-itn-modules-test-cosno-01"
      + network_acl_bypass_for_azure_services        = false
      + offer_type                                   = "Standard"
      + partition_merge_enabled                      = false
      + primary_key                                  = (sensitive value)
      + primary_mongodb_connection_string            = (sensitive value)
      + primary_readonly_key                         = (sensitive value)
      + primary_readonly_mongodb_connection_string   = (sensitive value)
      + primary_readonly_sql_connection_string       = (sensitive value)
      + primary_sql_connection_string                = (sensitive value)
      + public_network_access_enabled                = true
      + read_endpoints                               = (known after apply)
      + resource_group_name                          = "dx-d-itn-test-rg-01"
      + secondary_key                                = (sensitive value)
      + secondary_mongodb_connection_string          = (sensitive value)
      + secondary_readonly_key                       = (sensitive value)
      + secondary_readonly_mongodb_connection_string = (sensitive value)
      + secondary_readonly_sql_connection_string     = (sensitive value)
      + secondary_sql_connection_string              = (sensitive value)
      + tags                                         = {
          + "BusinessUnit"   = "DevEx"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Dev"
          + "ManagementTeam" = "Developer Experience"
          + "ModuleName"     = "azure_cosmos_account"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "0.1.0"
          + "Source"         = "https://github.com/pagopa/dx/modules/azure_core_infra/examples/develop"
        }
      + write_endpoints                              = (known after apply)

      + analytical_storage (known after apply)

      + backup {
          + interval_in_minutes = (known after apply)
          + retention_in_hours  = (known after apply)
          + storage_redundancy  = (known after apply)
          + tier                = "Continuous30Days"
          + type                = "Continuous"
        }

      + capabilities {
          + name = "EnableServerless"
        }

      + capacity (known after apply)

      + consistency_policy {
          + consistency_level = "Session"
        }

      + geo_location {
          + failover_priority = 0
          + id                = (known after apply)
          + location          = "italynorth"
          + zone_redundant    = true
        }
    }

  # module.cosmos.azurerm_private_endpoint.sql will be created
  + resource "azurerm_private_endpoint" "sql" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "italynorth"
      + name                     = "dx-d-itn-modules-test-cosno-pep-01"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "dx-d-itn-test-rg-01"
      + subnet_id                = (known after apply)
      + tags                     = {
          + "BusinessUnit"   = "DevEx"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Dev"
          + "ManagementTeam" = "Developer Experience"
          + "ModuleName"     = "azure_cosmos_account"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "0.1.0"
          + "Source"         = "https://github.com/pagopa/dx/modules/azure_core_infra/examples/develop"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "private-dns-zone-group"
          + private_dns_zone_ids = [
              + "/subscriptions/d7de83e0-0571-40ad-b63a-64c942385eae/resourceGroups/dx-d-itn-network-rg-01/providers/Microsoft.Network/privateDnsZones/privatelink.documents.azure.com",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "dx-d-itn-modules-test-cosno-pep-01"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "Sql",
            ]
        }
    }

  # module.storage_account.azurerm_private_endpoint.this["blob"] will be created
  + resource "azurerm_private_endpoint" "this" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "italynorth"
      + name                     = "dx-d-itn-modules-test-blob-pep-01"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "dx-d-itn-test-rg-01"
      + subnet_id                = (known after apply)
      + tags                     = {
          + "BusinessUnit"   = "DevEx"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Dev"
          + "ManagementTeam" = "Developer Experience"
          + "ModuleName"     = "azure_storage_account"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "1.0.0"
          + "Source"         = "https://github.com/pagopa/dx/modules/azure_core_infra/examples/develop"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "private-dns-zone-group"
          + private_dns_zone_ids = [
              + "/subscriptions/d7de83e0-0571-40ad-b63a-64c942385eae/resourceGroups/dx-d-itn-network-rg-01/providers/Microsoft.Network/privateDnsZones/privatelink.blob.core.windows.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "dx-d-itn-modules-test-blob-pep-01"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "blob",
            ]
        }
    }

  # module.storage_account.azurerm_storage_account.this will be created
  + resource "azurerm_storage_account" "this" {
      + access_tier                        = "Hot"
      + account_kind                       = "StorageV2"
      + account_replication_type           = "LRS"
      + account_tier                       = "Standard"
      + allow_nested_items_to_be_public    = false
      + cross_tenant_replication_enabled   = false
      + default_to_oauth_authentication    = false
      + dns_endpoint_type                  = "Standard"
      + https_traffic_only_enabled         = true
      + id                                 = (known after apply)
      + infrastructure_encryption_enabled  = false
      + is_hns_enabled                     = false
      + large_file_share_enabled           = (known after apply)
      + local_user_enabled                 = true
      + location                           = "italynorth"
      + min_tls_version                    = "TLS1_2"
      + name                               = "dxditnmodulestestst01"
      + nfsv3_enabled                      = false
      + primary_access_key                 = (sensitive value)
      + primary_blob_connection_string     = (sensitive value)
      + primary_blob_endpoint              = (known after apply)
      + primary_blob_host                  = (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      + primary_connection_string          = (sensitive value)
      + primary_dfs_endpoint               = (known after apply)
      + primary_dfs_host                   = (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      + primary_file_endpoint              = (known after apply)
      + primary_file_host                  = (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      + primary_location                   = (known after apply)
      + primary_queue_endpoint             = (known after apply)
      + primary_queue_host                 = (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      + primary_table_endpoint             = (known after apply)
      + primary_table_host                 = (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      + primary_web_endpoint               = (known after apply)
      + primary_web_host                   = (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      + public_network_access_enabled      = false
      + queue_encryption_key_type          = "Service"
      + resource_group_name                = "dx-d-itn-test-rg-01"
      + secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      + secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
      + sftp_enabled                       = false
      + shared_access_key_enabled          = true
      + table_encryption_key_type          = "Service"
      + tags                               = {
          + "BusinessUnit"   = "DevEx"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Dev"
          + "ManagementTeam" = "Developer Experience"
          + "ModuleName"     = "azure_storage_account"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "1.0.0"
          + "Source"         = "https://github.com/pagopa/dx/modules/azure_core_infra/examples/develop"
        }

      + blob_properties {
          + change_feed_enabled      = false
          + default_service_version  = (known after apply)
          + last_access_time_enabled = false
          + versioning_enabled       = false
        }

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + network_rules (known after apply)

      + queue_properties (known after apply)

      + routing (known after apply)

      + share_properties (known after apply)

      + static_website (known after apply)
    }

  # module.core.module.common_log_analytics.azurerm_log_analytics_workspace.this will be created
  + resource "azurerm_log_analytics_workspace" "this" {
      + allow_resource_only_permissions = true
      + daily_quota_gb                  = -1
      + id                              = (known after apply)
      + internet_ingestion_enabled      = true
      + internet_query_enabled          = true
      + local_authentication_disabled   = false
      + location                        = "italynorth"
      + name                            = "dx-d-itn-common-log-01"
      + primary_shared_key              = (sensitive value)
      + resource_group_name             = "dx-d-itn-common-rg-01"
      + retention_in_days               = 30
      + secondary_shared_key            = (sensitive value)
      + sku                             = "PerGB2018"
      + tags                            = {
          + "BusinessUnit"   = "DevEx"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Dev"
          + "ManagementTeam" = "Developer Experience"
          + "ModuleName"     = "azure_core_infra"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "1.0.9"
          + "Source"         = "https://github.com/pagopa/dx/modules/azure_core_infra/examples/develop"
        }
      + workspace_id                    = (known after apply)
    }

  # module.core.module.dns.azurerm_private_dns_zone.private_dns_zones["azure_api_net"] will be created
  + resource "azurerm_private_dns_zone" "private_dns_zones" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "azure-api.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "dx-d-itn-network-rg-01"
      + tags                                                  = {
          + "BusinessUnit"   = "DevEx"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Dev"
          + "ManagementTeam" = "Developer Experience"
          + "ModuleName"     = "azure_core_infra"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "1.0.9"
          + "Source"         = "https://github.com/pagopa/dx/modules/azure_core_infra/examples/develop"
        }

      + soa_record (known after apply)
    }

  # module.core.module.dns.azurerm_private_dns_zone.private_dns_zones["azurewebsites"] will be created
  + resource "azurerm_private_dns_zone" "private_dns_zones" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.azurewebsites.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "dx-d-itn-network-rg-01"
      + tags                                                  = {
          + "BusinessUnit"   = "DevEx"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Dev"
          + "ManagementTeam" = "Developer Experience"
          + "ModuleName"     = "azure_core_infra"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "1.0.9"
          + "Source"         = "https://github.com/pagopa/dx/modules/azure_core_infra/examples/develop"
        }

      + soa_record (known after apply)
    }

  # module.core.module.dns.azurerm_private_dns_zone.private_dns_zones["blob"] will be created
  + resource "azurerm_private_dns_zone" "private_dns_zones" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.blob.core.windows.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "dx-d-itn-network-rg-01"
      + tags                                                  = {
          + "BusinessUnit"   = "DevEx"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Dev"
          + "ManagementTeam" = "Developer Experience"
          + "ModuleName"     = "azure_core_infra"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "1.0.9"
          + "Source"         = "https://github.com/pagopa/dx/modules/azure_core_infra/examples/develop"
        }

      + soa_record (known after apply)
    }

  # module.core.module.dns.azurerm_private_dns_zone.private_dns_zones["container_app"] will be created
  + resource "azurerm_private_dns_zone" "private_dns_zones" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.italynorth.azurecontainerapps.io"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "dx-d-itn-network-rg-01"
      + tags                                                  = {
          + "BusinessUnit"   = "DevEx"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Dev"
          + "ManagementTeam" = "Developer Experience"
          + "ModuleName"     = "azure_core_infra"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "1.0.9"
          + "Source"         = "https://github.com/pagopa/dx/modules/azure_core_infra/examples/develop"
        }

      + soa_record (known after apply)
    }

  # module.core.module.dns.azurerm_private_dns_zone.private_dns_zones["documents"] will be created
  + resource "azurerm_private_dns_zone" "private_dns_zones" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.documents.azure.com"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "dx-d-itn-network-rg-01"
      + tags                                                  = {
          + "BusinessUnit"   = "DevEx"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Dev"
          + "ManagementTeam" = "Developer Experience"
          + "ModuleName"     = "azure_core_infra"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "1.0.9"
          + "Source"         = "https://github.com/pagopa/dx/modules/azure_core_infra/examples/develop"
        }

      + soa_record (known after apply)
    }

  # module.core.module.dns.azurerm_private_dns_zone.private_dns_zones["file"] will be created
  + resource "azurerm_private_dns_zone" "private_dns_zones" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.file.core.windows.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "dx-d-itn-network-rg-01"
      + tags                                                  = {
          + "BusinessUnit"   = "DevEx"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Dev"
          + "ManagementTeam" = "Developer Experience"
          + "ModuleName"     = "azure_core_infra"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "1.0.9"
          + "Source"         = "https://github.com/pagopa/dx/modules/azure_core_infra/examples/develop"
        }

      + soa_record (known after apply)
    }

  # module.core.module.dns.azurerm_private_dns_zone.private_dns_zones["management_azure_api_net"] will be created
  + resource "azurerm_private_dns_zone" "private_dns_zones" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "management.azure-api.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "dx-d-itn-network-rg-01"
      + tags                                                  = {
          + "BusinessUnit"   = "DevEx"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Dev"
          + "ManagementTeam" = "Developer Experience"
          + "ModuleName"     = "azure_core_infra"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "1.0.9"
          + "Source"         = "https://github.com/pagopa/dx/modules/azure_core_infra/examples/develop"
        }

      + soa_record (known after apply)
    }

  # module.core.module.dns.azurerm_private_dns_zone.private_dns_zones["psql"] will be created
  + resource "azurerm_private_dns_zone" "private_dns_zones" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.postgres.database.azure.com"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "dx-d-itn-network-rg-01"
      + tags                                                  = {
          + "BusinessUnit"   = "DevEx"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Dev"
          + "ManagementTeam" = "Developer Experience"
          + "ModuleName"     = "azure_core_infra"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "1.0.9"
          + "Source"         = "https://github.com/pagopa/dx/modules/azure_core_infra/examples/develop"
        }

      + soa_record (known after apply)
    }

  # module.core.module.dns.azurerm_private_dns_zone.private_dns_zones["queue"] will be created
  + resource "azurerm_private_dns_zone" "private_dns_zones" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.queue.core.windows.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "dx-d-itn-network-rg-01"
      + tags                                                  = {
          + "BusinessUnit"   = "DevEx"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Dev"
          + "ManagementTeam" = "Developer Experience"
          + "ModuleName"     = "azure_core_infra"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "1.0.9"
          + "Source"         = "https://github.com/pagopa/dx/modules/azure_core_infra/examples/develop"
        }

      + soa_record (known after apply)
    }

  # module.core.module.dns.azurerm_private_dns_zone.private_dns_zones["redis"] will be created
  + resource "azurerm_private_dns_zone" "private_dns_zones" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.redis.cache.windows.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "dx-d-itn-network-rg-01"
      + tags                                                  = {
          + "BusinessUnit"   = "DevEx"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Dev"
          + "ManagementTeam" = "Developer Experience"
          + "ModuleName"     = "azure_core_infra"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "1.0.9"
          + "Source"         = "https://github.com/pagopa/dx/modules/azure_core_infra/examples/develop"
        }

      + soa_record (known after apply)
    }

  # module.core.module.dns.azurerm_private_dns_zone.private_dns_zones["scm_azure_api_net"] will be created
  + resource "azurerm_private_dns_zone" "private_dns_zones" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "scm.azure-api.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "dx-d-itn-network-rg-01"
      + tags                                                  = {
          + "BusinessUnit"   = "DevEx"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Dev"
          + "ManagementTeam" = "Developer Experience"
          + "ModuleName"     = "azure_core_infra"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "1.0.9"
          + "Source"         = "https://github.com/pagopa/dx/modules/azure_core_infra/examples/develop"
        }

      + soa_record (known after apply)
    }

  # module.core.module.dns.azurerm_private_dns_zone.private_dns_zones["servicebus"] will be created
  + resource "azurerm_private_dns_zone" "private_dns_zones" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.servicebus.windows.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "dx-d-itn-network-rg-01"
      + tags                                                  = {
          + "BusinessUnit"   = "DevEx"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Dev"
          + "ManagementTeam" = "Developer Experience"
          + "ModuleName"     = "azure_core_infra"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "1.0.9"
          + "Source"         = "https://github.com/pagopa/dx/modules/azure_core_infra/examples/develop"
        }

      + soa_record (known after apply)
    }

  # module.core.module.dns.azurerm_private_dns_zone.private_dns_zones["srch"] will be created
  + resource "azurerm_private_dns_zone" "private_dns_zones" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.search.windows.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "dx-d-itn-network-rg-01"
      + tags                                                  = {
          + "BusinessUnit"   = "DevEx"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Dev"
          + "ManagementTeam" = "Developer Experience"
          + "ModuleName"     = "azure_core_infra"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "1.0.9"
          + "Source"         = "https://github.com/pagopa/dx/modules/azure_core_infra/examples/develop"
        }

      + soa_record (known after apply)
    }

  # module.core.module.dns.azurerm_private_dns_zone.private_dns_zones["table"] will be created
  + resource "azurerm_private_dns_zone" "private_dns_zones" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.table.core.windows.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "dx-d-itn-network-rg-01"
      + tags                                                  = {
          + "BusinessUnit"   = "DevEx"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Dev"
          + "ManagementTeam" = "Developer Experience"
          + "ModuleName"     = "azure_core_infra"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "1.0.9"
          + "Source"         = "https://github.com/pagopa/dx/modules/azure_core_infra/examples/develop"
        }

      + soa_record (known after apply)
    }

  # module.core.module.dns.azurerm_private_dns_zone.private_dns_zones["vault"] will be created
  + resource "azurerm_private_dns_zone" "private_dns_zones" {
      + id                                                    = (known after apply)
      + max_number_of_record_sets                             = (known after apply)
      + max_number_of_virtual_network_links                   = (known after apply)
      + max_number_of_virtual_network_links_with_registration = (known after apply)
      + name                                                  = "privatelink.vaultcore.azure.net"
      + number_of_record_sets                                 = (known after apply)
      + resource_group_name                                   = "dx-d-itn-network-rg-01"
      + tags                                                  = {
          + "BusinessUnit"   = "DevEx"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Dev"
          + "ManagementTeam" = "Developer Experience"
          + "ModuleName"     = "azure_core_infra"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "1.0.9"
          + "Source"         = "https://github.com/pagopa/dx/modules/azure_core_infra/examples/develop"
        }

      + soa_record (known after apply)
    }

  # module.core.module.dns.azurerm_private_dns_zone_virtual_network_link.private_dns_links["azure_api_net"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "private_dns_links" {
      + id                    = (known after apply)
      + name                  = "dx-d-itn-common-vnet-01"
      + private_dns_zone_name = "azure-api.net"
      + registration_enabled  = false
      + resource_group_name   = "dx-d-itn-network-rg-01"
      + tags                  = {
          + "BusinessUnit"   = "DevEx"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Dev"
          + "ManagementTeam" = "Developer Experience"
          + "ModuleName"     = "azure_core_infra"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "1.0.9"
          + "Source"         = "https://github.com/pagopa/dx/modules/azure_core_infra/examples/develop"
        }
      + virtual_network_id    = (known after apply)
    }

  # module.core.module.dns.azurerm_private_dns_zone_virtual_network_link.private_dns_links["azurewebsites"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "private_dns_links" {
      + id                    = (known after apply)
      + name                  = "dx-d-itn-common-vnet-01"
      + private_dns_zone_name = "privatelink.azurewebsites.net"
      + registration_enabled  = false
      + resource_group_name   = "dx-d-itn-network-rg-01"
      + tags                  = {
          + "BusinessUnit"   = "DevEx"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Dev"
          + "ManagementTeam" = "Developer Experience"
          + "ModuleName"     = "azure_core_infra"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "1.0.9"
          + "Source"         = "https://github.com/pagopa/dx/modules/azure_core_infra/examples/develop"
        }
      + virtual_network_id    = (known after apply)
    }

  # module.core.module.dns.azurerm_private_dns_zone_virtual_network_link.private_dns_links["blob"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "private_dns_links" {
      + id                    = (known after apply)
      + name                  = "dx-d-itn-common-vnet-01"
      + private_dns_zone_name = "privatelink.blob.core.windows.net"
      + registration_enabled  = false
      + resource_group_name   = "dx-d-itn-network-rg-01"
      + tags                  = {
          + "BusinessUnit"   = "DevEx"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Dev"
          + "ManagementTeam" = "Developer Experience"
          + "ModuleName"     = "azure_core_infra"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "1.0.9"
          + "Source"         = "https://github.com/pagopa/dx/modules/azure_core_infra/examples/develop"
        }
      + virtual_network_id    = (known after apply)
    }

  # module.core.module.dns.azurerm_private_dns_zone_virtual_network_link.private_dns_links["container_app"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "private_dns_links" {
      + id                    = (known after apply)
      + name                  = "dx-d-itn-common-vnet-01"
      + private_dns_zone_name = "privatelink.italynorth.azurecontainerapps.io"
      + registration_enabled  = false
      + resource_group_name   = "dx-d-itn-network-rg-01"
      + tags                  = {
          + "BusinessUnit"   = "DevEx"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Dev"
          + "ManagementTeam" = "Developer Experience"
          + "ModuleName"     = "azure_core_infra"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "1.0.9"
          + "Source"         = "https://github.com/pagopa/dx/modules/azure_core_infra/examples/develop"
        }
      + virtual_network_id    = (known after apply)
    }

  # module.core.module.dns.azurerm_private_dns_zone_virtual_network_link.private_dns_links["documents"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "private_dns_links" {
      + id                    = (known after apply)
      + name                  = "dx-d-itn-common-vnet-01"
      + private_dns_zone_name = "privatelink.documents.azure.com"
      + registration_enabled  = false
      + resource_group_name   = "dx-d-itn-network-rg-01"
      + tags                  = {
          + "BusinessUnit"   = "DevEx"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Dev"
          + "ManagementTeam" = "Developer Experience"
          + "ModuleName"     = "azure_core_infra"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "1.0.9"
          + "Source"         = "https://github.com/pagopa/dx/modules/azure_core_infra/examples/develop"
        }
      + virtual_network_id    = (known after apply)
    }

  # module.core.module.dns.azurerm_private_dns_zone_virtual_network_link.private_dns_links["file"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "private_dns_links" {
      + id                    = (known after apply)
      + name                  = "dx-d-itn-common-vnet-01"
      + private_dns_zone_name = "privatelink.file.core.windows.net"
      + registration_enabled  = false
      + resource_group_name   = "dx-d-itn-network-rg-01"
      + tags                  = {
          + "BusinessUnit"   = "DevEx"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Dev"
          + "ManagementTeam" = "Developer Experience"
          + "ModuleName"     = "azure_core_infra"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "1.0.9"
          + "Source"         = "https://github.com/pagopa/dx/modules/azure_core_infra/examples/develop"
        }
      + virtual_network_id    = (known after apply)
    }

  # module.core.module.dns.azurerm_private_dns_zone_virtual_network_link.private_dns_links["management_azure_api_net"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "private_dns_links" {
      + id                    = (known after apply)
      + name                  = "dx-d-itn-common-vnet-01"
      + private_dns_zone_name = "management.azure-api.net"
      + registration_enabled  = false
      + resource_group_name   = "dx-d-itn-network-rg-01"
      + tags                  = {
          + "BusinessUnit"   = "DevEx"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Dev"
          + "ManagementTeam" = "Developer Experience"
          + "ModuleName"     = "azure_core_infra"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "1.0.9"
          + "Source"         = "https://github.com/pagopa/dx/modules/azure_core_infra/examples/develop"
        }
      + virtual_network_id    = (known after apply)
    }

  # module.core.module.dns.azurerm_private_dns_zone_virtual_network_link.private_dns_links["psql"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "private_dns_links" {
      + id                    = (known after apply)
      + name                  = "dx-d-itn-common-vnet-01"
      + private_dns_zone_name = "privatelink.postgres.database.azure.com"
      + registration_enabled  = false
      + resource_group_name   = "dx-d-itn-network-rg-01"
      + tags                  = {
          + "BusinessUnit"   = "DevEx"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Dev"
          + "ManagementTeam" = "Developer Experience"
          + "ModuleName"     = "azure_core_infra"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "1.0.9"
          + "Source"         = "https://github.com/pagopa/dx/modules/azure_core_infra/examples/develop"
        }
      + virtual_network_id    = (known after apply)
    }

  # module.core.module.dns.azurerm_private_dns_zone_virtual_network_link.private_dns_links["queue"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "private_dns_links" {
      + id                    = (known after apply)
      + name                  = "dx-d-itn-common-vnet-01"
      + private_dns_zone_name = "privatelink.queue.core.windows.net"
      + registration_enabled  = false
      + resource_group_name   = "dx-d-itn-network-rg-01"
      + tags                  = {
          + "BusinessUnit"   = "DevEx"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Dev"
          + "ManagementTeam" = "Developer Experience"
          + "ModuleName"     = "azure_core_infra"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "1.0.9"
          + "Source"         = "https://github.com/pagopa/dx/modules/azure_core_infra/examples/develop"
        }
      + virtual_network_id    = (known after apply)
    }

  # module.core.module.dns.azurerm_private_dns_zone_virtual_network_link.private_dns_links["redis"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "private_dns_links" {
      + id                    = (known after apply)
      + name                  = "dx-d-itn-common-vnet-01"
      + private_dns_zone_name = "privatelink.redis.cache.windows.net"
      + registration_enabled  = false
      + resource_group_name   = "dx-d-itn-network-rg-01"
      + tags                  = {
          + "BusinessUnit"   = "DevEx"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Dev"
          + "ManagementTeam" = "Developer Experience"
          + "ModuleName"     = "azure_core_infra"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "1.0.9"
          + "Source"         = "https://github.com/pagopa/dx/modules/azure_core_infra/examples/develop"
        }
      + virtual_network_id    = (known after apply)
    }

  # module.core.module.dns.azurerm_private_dns_zone_virtual_network_link.private_dns_links["scm_azure_api_net"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "private_dns_links" {
      + id                    = (known after apply)
      + name                  = "dx-d-itn-common-vnet-01"
      + private_dns_zone_name = "scm.azure-api.net"
      + registration_enabled  = false
      + resource_group_name   = "dx-d-itn-network-rg-01"
      + tags                  = {
          + "BusinessUnit"   = "DevEx"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Dev"
          + "ManagementTeam" = "Developer Experience"
          + "ModuleName"     = "azure_core_infra"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "1.0.9"
          + "Source"         = "https://github.com/pagopa/dx/modules/azure_core_infra/examples/develop"
        }
      + virtual_network_id    = (known after apply)
    }

  # module.core.module.dns.azurerm_private_dns_zone_virtual_network_link.private_dns_links["servicebus"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "private_dns_links" {
      + id                    = (known after apply)
      + name                  = "dx-d-itn-common-vnet-01"
      + private_dns_zone_name = "privatelink.servicebus.windows.net"
      + registration_enabled  = false
      + resource_group_name   = "dx-d-itn-network-rg-01"
      + tags                  = {
          + "BusinessUnit"   = "DevEx"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Dev"
          + "ManagementTeam" = "Developer Experience"
          + "ModuleName"     = "azure_core_infra"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "1.0.9"
          + "Source"         = "https://github.com/pagopa/dx/modules/azure_core_infra/examples/develop"
        }
      + virtual_network_id    = (known after apply)
    }

  # module.core.module.dns.azurerm_private_dns_zone_virtual_network_link.private_dns_links["srch"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "private_dns_links" {
      + id                    = (known after apply)
      + name                  = "dx-d-itn-common-vnet-01"
      + private_dns_zone_name = "privatelink.search.windows.net"
      + registration_enabled  = false
      + resource_group_name   = "dx-d-itn-network-rg-01"
      + tags                  = {
          + "BusinessUnit"   = "DevEx"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Dev"
          + "ManagementTeam" = "Developer Experience"
          + "ModuleName"     = "azure_core_infra"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "1.0.9"
          + "Source"         = "https://github.com/pagopa/dx/modules/azure_core_infra/examples/develop"
        }
      + virtual_network_id    = (known after apply)
    }

  # module.core.module.dns.azurerm_private_dns_zone_virtual_network_link.private_dns_links["table"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "private_dns_links" {
      + id                    = (known after apply)
      + name                  = "dx-d-itn-common-vnet-01"
      + private_dns_zone_name = "privatelink.table.core.windows.net"
      + registration_enabled  = false
      + resource_group_name   = "dx-d-itn-network-rg-01"
      + tags                  = {
          + "BusinessUnit"   = "DevEx"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Dev"
          + "ManagementTeam" = "Developer Experience"
          + "ModuleName"     = "azure_core_infra"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "1.0.9"
          + "Source"         = "https://github.com/pagopa/dx/modules/azure_core_infra/examples/develop"
        }
      + virtual_network_id    = (known after apply)
    }

  # module.core.module.dns.azurerm_private_dns_zone_virtual_network_link.private_dns_links["vault"] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "private_dns_links" {
      + id                    = (known after apply)
      + name                  = "dx-d-itn-common-vnet-01"
      + private_dns_zone_name = "privatelink.vaultcore.azure.net"
      + registration_enabled  = false
      + resource_group_name   = "dx-d-itn-network-rg-01"
      + tags                  = {
          + "BusinessUnit"   = "DevEx"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Dev"
          + "ManagementTeam" = "Developer Experience"
          + "ModuleName"     = "azure_core_infra"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "1.0.9"
          + "Source"         = "https://github.com/pagopa/dx/modules/azure_core_infra/examples/develop"
        }
      + virtual_network_id    = (known after apply)
    }

  # module.core.module.github_runner.azurerm_container_app_environment.cae will be created
  + resource "azurerm_container_app_environment" "cae" {
      + custom_domain_verification_id    = (known after apply)
      + default_domain                   = (known after apply)
      + docker_bridge_cidr               = (known after apply)
      + id                               = (known after apply)
      + infrastructure_subnet_id         = (known after apply)
      + internal_load_balancer_enabled   = false
      + location                         = "italynorth"
      + log_analytics_workspace_id       = (known after apply)
      + logs_destination                 = (known after apply)
      + mutual_tls_enabled               = false
      + name                             = "dx-d-itn-github-runner-cae-01"
      + platform_reserved_cidr           = (known after apply)
      + platform_reserved_dns_ip_address = (known after apply)
      + resource_group_name              = "dx-d-itn-github-runner-rg-01"
      + static_ip_address                = (known after apply)
      + tags                             = {
          + "BusinessUnit"   = "DevEx"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Dev"
          + "ManagementTeam" = "Developer Experience"
          + "ModuleName"     = "azure_core_infra"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "1.0.9"
          + "Source"         = "https://github.com/pagopa/dx/modules/azure_core_infra/examples/develop"
        }
      + zone_redundancy_enabled          = false
    }

  # module.core.module.github_runner.azurerm_management_lock.lock_cae will be created
  + resource "azurerm_management_lock" "lock_cae" {
      + id         = (known after apply)
      + lock_level = "CanNotDelete"
      + name       = "dx-d-itn-github-runner-cae-01"
      + notes      = "This Container App Environment cannot be deleted"
      + scope      = (known after apply)
    }

  # module.core.module.github_runner.azurerm_subnet.runner_snet will be created
  + resource "azurerm_subnet" "runner_snet" {
      + address_prefixes                              = [
          + "10.0.242.0/23",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "dx-d-itn-github-runner-snet-01"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "dx-d-itn-network-rg-01"
      + virtual_network_name                          = "dx-d-itn-common-vnet-01"
    }

  # module.core.module.key_vault.azurerm_key_vault.common will be created
  + resource "azurerm_key_vault" "common" {
      + access_policy                 = (known after apply)
      + enable_rbac_authorization     = true
      + enabled_for_disk_encryption   = true
      + id                            = (known after apply)
      + location                      = "italynorth"
      + name                          = "dx-d-itn-common-kv-01"
      + public_network_access_enabled = true
      + purge_protection_enabled      = true
      + resource_group_name           = "dx-d-itn-common-rg-01"
      + sku_name                      = "standard"
      + soft_delete_retention_days    = 7
      + tags                          = {
          + "BusinessUnit"   = "DevEx"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Dev"
          + "ManagementTeam" = "Developer Experience"
          + "ModuleName"     = "azure_core_infra"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "1.0.9"
          + "Source"         = "https://github.com/pagopa/dx/modules/azure_core_infra/examples/develop"
        }
      + tenant_id                     = "7788edaf-0346-4068-9d79-c868aed15b3d"
      + vault_uri                     = (known after apply)

      + contact (known after apply)

      + network_acls {
          + bypass         = "AzureServices"
          + default_action = "Allow"
        }
    }

  # module.core.module.key_vault.azurerm_private_endpoint.vault will be created
  + resource "azurerm_private_endpoint" "vault" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "italynorth"
      + name                     = "dx-d-itn-modules-test-kv-pep-01"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "dx-d-itn-network-rg-01"
      + subnet_id                = (known after apply)

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "private-dns-zone-group"
          + private_dns_zone_ids = (known after apply)
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "dx-d-itn-modules-test-kv-pep-01"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "vault",
            ]
        }
    }

  # module.core.module.network.azurerm_subnet.pep_snet will be created
  + resource "azurerm_subnet" "pep_snet" {
      + address_prefixes                              = [
          + "10.60.1.0/23",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "dx-d-itn-pep-snet-01"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "dx-d-itn-network-rg-01"
      + virtual_network_name                          = "dx-d-itn-common-vnet-01"
    }

  # module.core.module.network.azurerm_virtual_network.vnet will be created
  + resource "azurerm_virtual_network" "vnet" {
      + address_space                  = [
          + "10.60.0.0/16",
        ]
      + dns_servers                    = (known after apply)
      + guid                           = (known after apply)
      + id                             = (known after apply)
      + location                       = "italynorth"
      + name                           = "dx-d-itn-common-vnet-01"
      + private_endpoint_vnet_policies = "Disabled"
      + resource_group_name            = "dx-d-itn-network-rg-01"
      + subnet                         = (known after apply)
      + tags                           = {
          + "BusinessUnit"   = "DevEx"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Dev"
          + "ManagementTeam" = "Developer Experience"
          + "ModuleName"     = "azure_core_infra"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "1.0.9"
          + "Source"         = "https://github.com/pagopa/dx/modules/azure_core_infra/examples/develop"
        }
    }

  # module.core.module.vpn[0].azurerm_subnet.dns_forwarder_snet will be created
  + resource "azurerm_subnet" "dns_forwarder_snet" {
      + address_prefixes                              = [
          + "10.60.252.8/29",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "dx-d-itn-dns-forwarder-snet-01"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "dx-d-itn-network-rg-01"
      + virtual_network_name                          = "dx-d-itn-common-vnet-01"

      + delegation {
          + name = "delegation"

          + service_delegation {
              + actions = [
                  + "Microsoft.Network/virtualNetworks/subnets/action",
                ]
              + name    = "Microsoft.ContainerInstance/containerGroups"
            }
        }
    }

  # module.core.module.vpn[0].azurerm_subnet.vpn_snet will be created
  + resource "azurerm_subnet" "vpn_snet" {
      + address_prefixes                              = [
          + "10.60.133.0/24",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "GatewaySubnet"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "dx-d-itn-network-rg-01"
      + virtual_network_name                          = "dx-d-itn-common-vnet-01"
    }

  # module.core.module.vpn[0].module.dns_forwarder.azurerm_container_group.this will be created
  + resource "azurerm_container_group" "this" {
      + dns_name_label_reuse_policy = "Unsecure"
      + exposed_port                = (known after apply)
      + fqdn                        = (known after apply)
      + id                          = (known after apply)
      + ip_address                  = (known after apply)
      + ip_address_type             = "Private"
      + location                    = "italynorth"
      + name                        = "dx-d-itn-dns-forwarder-ci-01"
      + network_profile_id          = (known after apply)
      + os_type                     = "Linux"
      + resource_group_name         = "dx-d-itn-network-rg-01"
      + restart_policy              = "Always"
      + sku                         = "Standard"
      + subnet_ids                  = (known after apply)
      + tags                        = {
          + "BusinessUnit"   = "DevEx"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Dev"
          + "ManagementTeam" = "Developer Experience"
          + "ModuleName"     = "azure_core_infra"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "1.0.9"
          + "Source"         = "https://github.com/pagopa/dx/modules/azure_core_infra/examples/develop"
        }

      + container {
          + commands = [
              + "/coredns",
              + "-conf",
              + "/app/conf/Corefile",
            ]
          + cpu      = 0.5
          + image    = "coredns/coredns:1.10.1@sha256:be7652ce0b43b1339f3d14d9b14af9f588578011092c1f7893bd55432d83a378"
          + memory   = 0.5
          + name     = "dns-forwarder"

          + ports {
              + port     = 53
              + protocol = "UDP"
            }

          + volume {
              + empty_dir  = false
              + mount_path = "/app/conf"
              + name       = "dns-forwarder-conf"
              + read_only  = true
              + secret     = (sensitive value)
            }
        }
    }

  # module.core.module.vpn[0].module.dns_forwarder.null_resource.secret_trigger will be created
  + resource "null_resource" "secret_trigger" {
      + id       = (known after apply)
      + triggers = {
          + "trigger" = "Ljo1MyB7CiAgICBlcnJvcnMKICAgIHJlYWR5CiAgICBoZWFsdGgKICAgIGZvcndhcmQgLiAxNjguNjMuMTI5LjE2CiAgICBjYWNoZSAzMAogICAgbG9vcAogICAgcmVsb2FkCn0K"
        }
    }

  # module.core.module.vpn[0].module.vpn.azurerm_public_ip.gw[0] will be created
  + resource "azurerm_public_ip" "gw" {
      + allocation_method       = "Static"
      + ddos_protection_mode    = "VirtualNetworkInherited"
      + domain_name_label       = (known after apply)
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "italynorth"
      + name                    = "dx-d-itn-vgw-01-gw-pip"
      + resource_group_name     = "dx-d-itn-network-rg-01"
      + sku                     = "Standard"
      + sku_tier                = "Regional"
      + tags                    = {
          + "BusinessUnit"   = "DevEx"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Dev"
          + "ManagementTeam" = "Developer Experience"
          + "ModuleName"     = "azure_core_infra"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "1.0.9"
          + "Source"         = "https://github.com/pagopa/dx/modules/azure_core_infra/examples/develop"
        }
    }

  # module.core.module.vpn[0].module.vpn.azurerm_virtual_network_gateway.gw will be created
  + resource "azurerm_virtual_network_gateway" "gw" {
      + active_active                         = false
      + bgp_route_translation_for_nat_enabled = false
      + enable_bgp                            = false
      + generation                            = (known after apply)
      + id                                    = (known after apply)
      + ip_sec_replay_protection_enabled      = true
      + location                              = "italynorth"
      + name                                  = "dx-d-itn-vgw-01-gw"
      + remote_vnet_traffic_enabled           = false
      + resource_group_name                   = "dx-d-itn-network-rg-01"
      + sku                                   = "VpnGw1"
      + tags                                  = {
          + "BusinessUnit"   = "DevEx"
          + "CostCenter"     = "TS000 - Tecnologia e Servizi"
          + "CreatedBy"      = "Terraform"
          + "Environment"    = "Dev"
          + "ManagementTeam" = "Developer Experience"
          + "ModuleName"     = "azure_core_infra"
          + "ModuleSource"   = "DX"
          + "ModuleVersion"  = "1.0.9"
          + "Source"         = "https://github.com/pagopa/dx/modules/azure_core_infra/examples/develop"
        }
      + type                                  = "Vpn"
      + virtual_wan_traffic_enabled           = false
      + vpn_type                              = "RouteBased"

      + bgp_settings (known after apply)

      + ip_configuration {
          + name                          = "dx-d-itn-vgw-01-gw-config"
          + private_ip_address_allocation = "Dynamic"
          + public_ip_address_id          = (known after apply)
          + subnet_id                     = (known after apply)
        }

      + vpn_client_configuration {
          + aad_audience         = "854cef16-360b-4751-9206-21b958321a83"
          + aad_issuer           = "https://sts.windows.net/7788edaf-0346-4068-9d79-c868aed15b3d/"
          + aad_tenant           = "https://login.microsoftonline.com/7788edaf-0346-4068-9d79-c868aed15b3d"
          + address_space        = [
              + "172.16.2.0/24",
            ]
          + vpn_auth_types       = (known after apply)
          + vpn_client_protocols = [
              + "OpenVPN",
            ]
        }
    }

  # module.core.module.vpn[0].module.vpn.random_string.dns will be created
  + resource "random_string" "dns" {
      + id          = (known after apply)
      + length      = 6
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = true
      + numeric     = true
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

Plan: 61 to add, 0 to change, 0 to destroy.


</details>
